[Language]
Main_Title=Terima kasih telah memilih EaseUS Data Recovery Wizard
Sub_Title=Bagaimana Anda akan menilai pengalaman Anda secara keseluruhan?
Terrible=Mengerikan
Poor=Miskin
Good=Bagus
Great=Hebat
Excellent=Excellent
Never_Ask_Again=Sangat baik
Rate_Now=Menilai sekarang
Feedback_Text_Tips=Silakan tinggalkan umpan balik Anda di sini.
Feedback_Length_Tips=Anda telah memasukkan Surat-surat yang lebih dari 500.Silahkan email masukan lebih banyak untuk support@easeus.com.